:PROPERTIES:
:ID:       fd722d95-80c0-4801-8d70-6b0cc8b227fc
:END:
#+title: Memory Management
#+created_at: 20210324171715

- a task of the System Kernel
- dynamic memory allocation is needed to better utilize the physical memory usage
  + once the address is allocated to process, it cannot be changed
- Memory Managment handles
  + Relocation
  + Protection
  + Sharing
  + Logical Organization
  + Physical Organization
- May involve movement between RAM and Disk, or Disk and RAM

* understanding mmap
#+begin_src shell :results verbatim
apropos mmap
#+end_src

#+RESULTS:
: mmap (2)             - map or unmap files or devices into memory
: mmap (3p)            - map pages of memory
: mmap2 (2)            - map files or devices into memory
: mmap64 (3)           - map or unmap files or devices into memory
: PerlIO::mmap (3perl) - Memory mapped IO
: XkbOutOfRangeGroupInfo (3) - Returns only the out-of-range processing informa...
: XkbOutOfRangeGroupNumber (3) - Returns the out-of-range group number, represe...

- focus on relationship between: user's ASM code instructions & page table entries & and how kernel and CPU use them
- page table maps only in direction from virtual address space to physical memory. It's not possible to use page table to simply reverse that direction and find out which physical address is mapped to which virtual address
- fork with paging[[id:bf2625f2-703a-4646-9299-e6f8213db340][???]] - copy page table, mark writeable things RO but copy on write. No new physical memory needed until pages are written
- exec with paging[[id:bf2625f2-703a-4646-9299-e6f8213db340][???]] - set up new page tabl, mark where pages are on disk. No new physical memory needed until pages are accessed.
- [[id:bf2625f2-703a-4646-9299-e6f8213db340][???]] the advantage of posix_spawn (and linux clone syscall) - can avoid copying the original page table if exec is going to overwrite it all

